Revit 2024 API
ImageExportOptions.ExportRange Property
 The export range defining which view(s) will be exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ExportRange ExportRange { get; set; }
Visual Basic
Public Property ExportRange As ExportRange
	Get
	Set
Visual C++
public:
property ExportRange ExportRange {
	ExportRange get ();
	void set (ExportRange value);
}
Remarks
 Note that SetOfViews is not an acceptable value if these options are used to save an image to a project as a new view.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ImageExportOptions Class
Autodesk.Revit.DB Namespace